app/controllers/tejidos_controller.rb

SELECT "tejidos".* FROM "tejidos"
---
    def index
        tej = Tejido.all

SELECT "tejidos".* FROM "tejidos" WHERE "tejidos"."id" = 1 LIMIT 1
---
    def show
        tej =  Tejido.find(params[:id])