app/controllers/user_controller.rb

SELECT "users".* FROM "users"
---
  def index
    user = User.all